// Что такое алгоритм? Из чего состоит программа?

// Что такое переменная? Как ее создать / изменить?

// Что такое "тип данных"? Какие типы данных есть в js ? Как узнать тип значения?

// Что такое оператор? Что такое выражение? 

// Виды условных операторов?

// Виды циклов?

// Логические операции? 

// Как обойтись без логических операций?

// Что такое функция? 3 способа объявления функции? Аргументы функции ?

// Что возвращает функция?

// Ввод / вывод в JS

// Что такое замыкание? Пример замыкания?

// Рекурсия ? Виды рекурсии ? Важные моменты при работе с рекурсией ?

// Что такое объект?

// Что такое функция? 

// Что такое "наследование" ? ООП модель в JS ? "Классы"

// Проверить объект на принадлежность к "классу"

// Какие "стандартные классы" есть в js?